Autodesk.Revit.Exceptions.FileAccessException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.FileAccessException
The exception that is thrown when the specified file could not be accessed, e.g. read-only, locked by the OS etc.